/**
 * СГЕНЕРИРОВАНО. Не править руками — правьте SVG рядом и запускайте
 * `npm run generate --workspace=@soldy/icons-material`.
 */

import type { TIconSource } from '@soldy/setup'

export const arrowDown: TIconSource = {
	viewBox: '0 -960 960 960',
	body: '<g transform="rotate(90 480 -480)"><path d="M504-480 348-636q-11-11-11-28t11-28q11-11 28-11t28 11l184 184q6 6 8.5 13t2.5 15q0 8-2.5 15t-8.5 13L404-268q-11 11-28 11t-28-11q-11-11-11-28t11-28l156-156Z"/></g>',
}

export const arrowRight: TIconSource = {
	viewBox: '0 -960 960 960',
	body: '<path d="M504-480 348-636q-11-11-11-28t11-28q11-11 28-11t28 11l184 184q6 6 8.5 13t2.5 15q0 8-2.5 15t-8.5 13L404-268q-11 11-28 11t-28-11q-11-11-11-28t11-28l156-156Z"/>',
}

export const check: TIconSource = {
	viewBox: '0 -960 960 960',
	body: '<path d="m382-354 339-339q12-12 28-12t28 12q12 12 12 28.5T777-636L410-268q-12 12-28 12t-28-12L182-440q-12-12-11.5-28.5T183-497q12-12 28.5-12t28.5 12l142 143Z"/>',
}

export const checkIndeterminate: TIconSource = {
	viewBox: '0 -960 960 960',
	body: '<path d="M280-440q-17 0-28.5-11.5T240-480q0-17 11.5-28.5T280-520h400q17 0 28.5 11.5T720-480q0 17-11.5 28.5T680-440H280Z"/>',
}

export const close: TIconSource = {
	viewBox: '0 -960 960 960',
	body: '<path d="M480-424 284-228q-11 11-28 11t-28-11q-11-11-11-28t11-28l196-196-196-196q-11-11-11-28t11-28q11-11 28-11t28 11l196 196 196-196q11-11 28-11t28 11q11 11 11 28t-11 28L536-480l196 196q11 11 11 28t-11 28q-11 11-28 11t-28-11L480-424Z"/>',
}

export const home: TIconSource = {
	viewBox: '0 -960 960 960',
	body: '<path d="M240-200h120v-200q0-17 11.5-28.5T400-440h160q17 0 28.5 11.5T600-400v200h120v-360L480-740 240-560v360Zm-80 0v-360q0-19 8.5-36t23.5-28l240-180q21-16 48-16t48 16l240 180q15 11 23.5 28t8.5 36v360q0 33-23.5 56.5T720-120H560q-17 0-28.5-11.5T520-160v-200h-80v200q0 17-11.5 28.5T400-120H240q-33 0-56.5-23.5T160-200Zm320-270Z"/>',
}
